# 列表和元组的基本方法
# 一、列表的增删查改（必须要掌握的知识点）
# 1、修改元素：通过列表的下标，指定元素进行修改
l1 = [11, 22, 33, 44, 55, 66]
l1[2] = 333
print(l1)
# 2、添加元素：
# 方法一：append 往列表的尾部添加元素（调用之后不用变量接收结果）
l2 = ["a", "b", "c"]
a = l1.append("zbc")
print(l2)
print(a)
# 方法二：insert指定下标位置添加元素（调用之后不用变量接收结果）
l3 = [1, 2, 3, "a", "b", "c"]
l3.insert(2, "llll")
print(l3)

# 1、在列表最前边添加一个元素
l3.insert(0, "yy")
print(l3)
# 2、在列表最后边添加一个元素
l4 = [1, 2, 3, "a", "b", "c"]
l4.insert(-1, "ying")
# ['yy', 1, 2, 'llll', 3, 'a', 'b', 'ying', 'c']
print(l4)
# 正确示范：下标改为“6”，或者直接用 append 方法
l5 = [1, 2, 3, "a", "b", "c"]
l4.append("ying")
print(l5)
l6 = [1, 2, 3, "a", "b", "c"]
l4.insert(6,"ying")
print(l6)

# 方法三：extend 一次性往列表尾部添加多个元素（调用之后不用接收结果）


